БИТУправление_медицинским_центром_демо/src/Enums/КлассификацииДиагнозов/КлассификацииДиагнозов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КлассификацииДиагнозов</name>
  <enumValues>
    <name>Предварительный</name>
    <comment>Степень обоснованности диагноза (1.2.643.5.1.13.13.11.1076)</comment>
  </enumValues>
  <enumValues>
    <name>Окончательный</name>
    <comment>Степень обоснованности диагноза (1.2.643.5.1.13.13.11.1076)</comment>
  </enumValues>
  <enumValues>
    <name>РискЗаболевания</name>
  </enumValues>
  <enumValues>
    <name>Острое</name>
    <comment>Характер заболевания (1.2.643.5.1.13.13.11.1049)</comment>
  </enumValues>
  <enumValues>
    <name>ХроническоеВпервыеВыявленное</name>
    <comment>Характер заболевания (1.2.643.5.1.13.13.11.1049)</comment>
  </enumValues>
  <enumValues>
    <name>ХроническоеРанееВыявленное</name>
    <comment>Характер заболевания (1.2.643.5.1.13.13.11.1049)</comment>
  </enumValues>
  <enumValues>
    <name>ОбострениеХронического</name>
  </enumValues>
  <enumValues>
    <name>ОсновноеЗаболевание</name>
    <comment>Виды нозологических единиц диагноза (1.2.643.5.1.13.13.11.1077)</comment>
  </enumValues>
  <enumValues>
    <name>ОсложнениеОсновногоЗаболевания</name>
    <comment>Виды нозологических единиц диагноза (1.2.643.5.1.13.13.11.1077)</comment>
  </enumValues>
  <enumValues>
    <name>СопутствующееЗаболевание</name>
    <comment>Виды нозологических единиц диагноза (1.2.643.5.1.13.13.11.1077)</comment>
  </enumValues>
  <enumValues>
    <name>ОсложнениеСопутствующегоЗаболевания</name>
    <comment>Виды нозологических единиц диагноза (1.2.643.5.1.13.13.11.1077)</comment>
  </enumValues>
  <enumValues>
    <name>КонкурирующееЗаболевание</name>
    <comment>Виды нозологических единиц диагноза (1.2.643.5.1.13.13.11.1077)</comment>
  </enumValues>
  <enumValues>
    <name>ФоновоеЗаболевание</name>
    <comment>Виды нозологических единиц диагноза (1.2.643.5.1.13.13.11.1077)</comment>
  </enumValues>
  <enumValues>
    <name>ВнешняяПричина</name>
    <comment>Виды нозологических единиц диагноза (1.2.643.5.1.13.13.11.1077)</comment>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/CommonModules/МедицинскаяДеятельностьПовтИсп/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает булево значение, соответствующее наличию в конфигурации справочника "СтраховыеПолисы".
// 
// Возвращаемое значение:
//   Булево.
//
Функция ИспользуютсяПолисы() Экспорт
	Если Метаданные.Справочники.Найти("СтраховыеПолисы") = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;	
	КонецЕсли;
КонецФункции

// Возвращает булево значение, соответствующее наличию в табличной части диагнозов документа Прием данных о зубе, 
// сегменте зуба.
// 
// Возвращаемое значение:
//   Булево.
//
Функция ЕстьЗубыВДиагнозахПриемов() Экспорт

	Возврат Метаданные.Документы.Прием.ТабличныеЧасти.Диагнозы.Реквизиты.Найти("ЗубВКарте") <> Неопределено;
	
КонецФункции

// Группы состояния здоровья в виде номера и представления.
// 
// Возвращаемое значение:
//  СписокЗначений.
//
Функция ПолучитьГруппыСостоянияЗдоровья() Экспорт
	
	СписокГруппСостоянияЗдоровья = Новый СписокЗначений;
	СписокГруппСостоянияЗдоровья.Добавить(1, "I группа");
	СписокГруппСостоянияЗдоровья.Добавить(2, "II группа");
	СписокГруппСостоянияЗдоровья.Добавить(3, "III группа");
	СписокГруппСостоянияЗдоровья.Добавить(4, "IV группа");
	СписокГруппСостоянияЗдоровья.Добавить(5, "V группа");
	
	Возврат СписокГруппСостоянияЗдоровья;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Все варианты значений классификации диагнозов по виду нозологической единицы (по мотивам 1.2.643.5.1.13.13.11.1077).
// 
// Возвращаемое значение:
//  Массив - из Перечисления.КлассификацииДиагнозов.
//
Функция ВидыНозологий() Экспорт
	
	пчВидыНозологии = Перечисления.КлассификацииДиагнозов;
	ВидыНозологий = Новый Массив;
	ВидыНозологий.Добавить(пчВидыНозологии.ОсновноеЗаболевание);
	ВидыНозологий.Добавить(пчВидыНозологии.ОсложнениеОсновногоЗаболевания);
	ВидыНозологий.Добавить(пчВидыНозологии.СопутствующееЗаболевание);
	ВидыНозологий.Добавить(пчВидыНозологии.ВнешняяПричина);
	ВидыНозологий.Добавить(пчВидыНозологии.КонкурирующееЗаболевание);
	ВидыНозологий.Добавить(пчВидыНозологии.ФоновоеЗаболевание);
	ВидыНозологий.Добавить(пчВидыНозологии.ОсложнениеСопутствующегоЗаболевания);
	
	Возврат ВидыНозологий;
	
КонецФункции

// См. Обработки.ИнтерфейсВводаПолейЭМД.СвязиНазначенийПараметровДляВвода().
//
Функция СвязиНазначенийПараметровШаблонов() Экспорт
	
	Возврат Обработки.ИнтерфейсВводаПолейЭМД.СвязиНазначенийПараметровДляВвода();
	
КонецФункции

#КонецОбласти
